wk8/redis-set-get-perf.txt
file contains redis get set performance information
***** command [redis-benchmark -t set,get -c 1000 -P 10 -d 10] is running *****
====== SET ======
  100000 requests completed in 0.06 seconds
  1000 parallel clients
  10 bytes payload
  keep alive: 1

0.00% <= 2 milliseconds
1.17% <= 3 milliseconds
16.60% <= 4 milliseconds
59.09% <= 5 milliseconds
81.63% <= 6 milliseconds
95.14% <= 7 milliseconds
98.93% <= 8 milliseconds
100.00% <= 8 milliseconds
1538461.62 requests per second

====== GET ======
  100000 requests completed in 0.06 seconds
  1000 parallel clients
  10 bytes payload
  keep alive: 1

0.00% <= 2 milliseconds
1.94% <= 3 milliseconds
27.79% <= 4 milliseconds
69.06% <= 5 milliseconds
88.65% <= 6 milliseconds
98.04% <= 7 milliseconds
99.52% <= 8 milliseconds
100.00% <= 8 milliseconds
1694915.25 requests per second


***** command [redis-benchmark -t set,get -c 1000 -P 10 -d 20] is running *****
====== SET ======
  100000 requests completed in 0.08 seconds
  1000 parallel clients
  20 bytes payload
  keep alive: 1

0.00% <= 3 milliseconds
15.72% <= 4 milliseconds
55.17% <= 5 milliseconds
75.26% <= 6 milliseconds
85.84% <= 7 milliseconds
88.82% <= 8 milliseconds
90.15% <= 9 milliseconds
91.20% <= 10 milliseconds
92.28% <= 11 milliseconds
93.90% <= 12 milliseconds
95.46% <= 13 milliseconds
97.25% <= 14 milliseconds
99.10% <= 15 milliseconds
100.00% <= 15 milliseconds
1333333.25 requests per second

====== GET ======
  100000 requests completed in 0.06 seconds
  1000 parallel clients
  20 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
1.36% <= 2 milliseconds
21.17% <= 3 milliseconds
58.39% <= 4 milliseconds
86.56% <= 5 milliseconds
96.92% <= 6 milliseconds
99.78% <= 7 milliseconds
100.00% <= 7 milliseconds
1724138.00 requests per second


***** command [redis-benchmark -t set,get -c 1000 -P 10 -d 50] is running *****
====== SET ======
  100000 requests completed in 0.07 seconds
  1000 parallel clients
  50 bytes payload
  keep alive: 1

0.00% <= 2 milliseconds
0.88% <= 3 milliseconds
7.59% <= 4 milliseconds
31.54% <= 5 milliseconds
66.76% <= 6 milliseconds
85.83% <= 7 milliseconds
96.91% <= 8 milliseconds
99.67% <= 9 milliseconds
100.00% <= 9 milliseconds
1428571.38 requests per second

====== GET ======
  100000 requests completed in 0.06 seconds
  1000 parallel clients
  50 bytes payload
  keep alive: 1

0.00% <= 2 milliseconds
6.54% <= 3 milliseconds
30.95% <= 4 milliseconds
64.55% <= 5 milliseconds
89.18% <= 6 milliseconds
97.75% <= 7 milliseconds
99.63% <= 8 milliseconds
100.00% <= 8 milliseconds
1639344.25 requests per second


***** command [redis-benchmark -t set,get -c 1000 -P 10 -d 100] is running *****
====== SET ======
  100000 requests completed in 0.07 seconds
  1000 parallel clients
  100 bytes payload
  keep alive: 1

0.00% <= 2 milliseconds
0.59% <= 3 milliseconds
8.45% <= 4 milliseconds
44.04% <= 5 milliseconds
71.12% <= 6 milliseconds
89.16% <= 7 milliseconds
97.41% <= 8 milliseconds
99.67% <= 9 milliseconds
100.00% <= 9 milliseconds
1492537.25 requests per second

====== GET ======
  100000 requests completed in 0.09 seconds
  1000 parallel clients
  100 bytes payload
  keep alive: 1

0.00% <= 4 milliseconds
7.44% <= 5 milliseconds
26.99% <= 6 milliseconds
62.10% <= 7 milliseconds
81.20% <= 8 milliseconds
91.25% <= 9 milliseconds
96.74% <= 10 milliseconds
98.87% <= 11 milliseconds
99.81% <= 12 milliseconds
100.00% <= 12 milliseconds
1123595.50 requests per second


***** command [redis-benchmark -t set,get -c 1000 -P 10 -d 200] is running *****
====== SET ======
  100000 requests completed in 0.07 seconds
  1000 parallel clients
  200 bytes payload
  keep alive: 1

0.00% <= 2 milliseconds
0.51% <= 3 milliseconds
7.76% <= 4 milliseconds
39.58% <= 5 milliseconds
70.64% <= 6 milliseconds
88.30% <= 7 milliseconds
97.42% <= 8 milliseconds
99.42% <= 9 milliseconds
99.78% <= 10 milliseconds
100.00% <= 10 milliseconds
1388889.00 requests per second

====== GET ======
  100000 requests completed in 0.06 seconds
  1000 parallel clients
  200 bytes payload
  keep alive: 1

0.00% <= 2 milliseconds
8.52% <= 3 milliseconds
33.17% <= 4 milliseconds
69.16% <= 5 milliseconds
89.69% <= 6 milliseconds
97.14% <= 7 milliseconds
99.47% <= 8 milliseconds
100.00% <= 8 milliseconds
1639344.25 requests per second


***** command [redis-benchmark -t set,get -c 1000 -P 10 -d 500] is running *****
====== SET ======
  100000 requests completed in 0.08 seconds
  1000 parallel clients
  500 bytes payload
  keep alive: 1

0.00% <= 3 milliseconds
2.37% <= 4 milliseconds
22.32% <= 5 milliseconds
60.04% <= 6 milliseconds
79.63% <= 7 milliseconds
93.25% <= 8 milliseconds
97.70% <= 9 milliseconds
99.30% <= 10 milliseconds
100.00% <= 10 milliseconds
1315789.50 requests per second

====== GET ======
  100000 requests completed in 0.07 seconds
  1000 parallel clients
  500 bytes payload
  keep alive: 1

0.00% <= 2 milliseconds
11.05% <= 3 milliseconds
46.34% <= 4 milliseconds
60.07% <= 5 milliseconds
82.40% <= 6 milliseconds
93.48% <= 7 milliseconds
98.31% <= 8 milliseconds
99.62% <= 9 milliseconds
100.00% <= 9 milliseconds
1388889.00 requests per second


***** command [redis-benchmark -t set,get -c 1000 -P 10 -d 1000] is running *****
====== SET ======
  100000 requests completed in 0.09 seconds
  1000 parallel clients
  1000 bytes payload
  keep alive: 1

0.00% <= 3 milliseconds
0.75% <= 4 milliseconds
4.83% <= 5 milliseconds
33.52% <= 6 milliseconds
63.80% <= 7 milliseconds
80.24% <= 8 milliseconds
92.48% <= 9 milliseconds
97.94% <= 10 milliseconds
99.56% <= 11 milliseconds
99.81% <= 12 milliseconds
100.00% <= 12 milliseconds
1162790.62 requests per second

====== GET ======
  100000 requests completed in 0.09 seconds
  1000 parallel clients
  1000 bytes payload
  keep alive: 1

0.00% <= 2 milliseconds
0.50% <= 3 milliseconds
32.53% <= 4 milliseconds
68.74% <= 5 milliseconds
82.29% <= 6 milliseconds
86.96% <= 7 milliseconds
90.45% <= 8 milliseconds
93.62% <= 9 milliseconds
97.06% <= 10 milliseconds
98.37% <= 11 milliseconds
99.19% <= 12 milliseconds
99.77% <= 13 milliseconds
100.00% <= 13 milliseconds
1162790.62 requests per second


***** command [redis-benchmark -t set,get -c 1000 -P 10 -d 2000] is running *****
====== SET ======
  100000 requests completed in 0.13 seconds
  1000 parallel clients
  2000 bytes payload
  keep alive: 1

0.00% <= 3 milliseconds
0.19% <= 4 milliseconds
17.12% <= 5 milliseconds
58.14% <= 6 milliseconds
77.18% <= 7 milliseconds
88.96% <= 8 milliseconds
94.54% <= 9 milliseconds
97.13% <= 10 milliseconds
98.67% <= 11 milliseconds
99.53% <= 12 milliseconds
99.74% <= 14 milliseconds
100.00% <= 14 milliseconds
757575.75 requests per second

====== GET ======
  100000 requests completed in 0.13 seconds
  1000 parallel clients
  2000 bytes payload
  keep alive: 1

0.00% <= 3 milliseconds
0.11% <= 4 milliseconds
0.55% <= 5 milliseconds
1.53% <= 6 milliseconds
3.80% <= 7 milliseconds
6.91% <= 8 milliseconds
16.21% <= 9 milliseconds
39.70% <= 10 milliseconds
57.76% <= 11 milliseconds
74.90% <= 12 milliseconds
88.76% <= 13 milliseconds
92.65% <= 14 milliseconds
94.83% <= 15 milliseconds
97.56% <= 16 milliseconds
98.57% <= 17 milliseconds
98.93% <= 18 milliseconds
99.22% <= 19 milliseconds
99.34% <= 20 milliseconds
99.88% <= 21 milliseconds
100.00% <= 21 milliseconds
787401.56 requests per second


***** command [redis-benchmark -t set,get -c 1000 -P 10 -d 5000] is running *****
====== SET ======
  100000 requests completed in 0.25 seconds
  1000 parallel clients
  5000 bytes payload
  keep alive: 1

0.00% <= 3 milliseconds
0.05% <= 4 milliseconds
5.08% <= 5 milliseconds
34.39% <= 6 milliseconds
64.10% <= 7 milliseconds
84.61% <= 8 milliseconds
91.25% <= 9 milliseconds
94.61% <= 10 milliseconds
97.30% <= 11 milliseconds
98.37% <= 12 milliseconds
98.93% <= 13 milliseconds
99.46% <= 14 milliseconds
99.99% <= 15 milliseconds
100.00% <= 15 milliseconds
401606.44 requests per second

====== GET ======
  100000 requests completed in 0.20 seconds
  1000 parallel clients
  5000 bytes payload
  keep alive: 1

0.00% <= 3 milliseconds
0.02% <= 4 milliseconds
1.04% <= 5 milliseconds
3.69% <= 6 milliseconds
5.86% <= 7 milliseconds
9.45% <= 8 milliseconds
13.28% <= 9 milliseconds
16.76% <= 10 milliseconds
19.72% <= 11 milliseconds
23.80% <= 12 milliseconds
28.45% <= 13 milliseconds
32.19% <= 14 milliseconds
39.19% <= 15 milliseconds
49.92% <= 16 milliseconds
68.92% <= 17 milliseconds
76.07% <= 18 milliseconds
80.61% <= 19 milliseconds
85.24% <= 20 milliseconds
88.39% <= 21 milliseconds
90.63% <= 22 milliseconds
92.06% <= 23 milliseconds
92.56% <= 24 milliseconds
93.00% <= 25 milliseconds
93.40% <= 26 milliseconds
94.38% <= 27 milliseconds
95.24% <= 28 milliseconds
97.26% <= 29 milliseconds
97.95% <= 30 milliseconds
99.33% <= 31 milliseconds
99.39% <= 32 milliseconds
99.72% <= 34 milliseconds
99.78% <= 35 milliseconds
99.89% <= 36 milliseconds
100.00% <= 36 milliseconds
495049.50 requests per second